[
  {
    "title": "Habitify",
    "content": "I developed a responsive habit-tracking web application to enhance productivity and consistency. Built with React, TypeScript, and Tailwind CSS, the app features animated elements, calendar heat maps for visual habit tracking, and integrates Firebase Authentication and Firestore for secure user management and data storage. Currently, the app serves 6 active users, with around 54 visitors and 327 page views.",
    "link": "https://habitifyy.vercel.app/",
    "githubLink": "https://github.com/aryanbhat/habitify",
    "image": "/habitify.png",
    "technologies": [
      "TypeScript",
      "JavaScript",
      "Tailwind CSS",
      "Firebase",
      "Redux Toolkit",
      "Shadcn/ui",
      "Nivo"
    ]
  },
  {
    "title": "Coursify",
    "content": "I developed Coursify, an e-learning web app using the MERN stack. I utilized MongoDB for course management, designed the backend with Express and Node.js for smooth data handling, and crafted a responsive user interface with React and Material UI. Additionally, I implemented secure user authentication with JWT to ensure data privacy and secure course access.",
    "image": "/coursify.webp",
    "link": "https://coursify-eosin.vercel.app/login",
    "githubLink": "https://github.com/aryanbhat/coursify",
    "technologies": [
      "NodeJS",
      "Express",
      "React",
      "MongoDB",
      "JWT",
      "Material UI"
    ]
  },
  {
    "title": "KnowYourPlace",
    "content": "I developed a responsive weather news application using HTML, CSS, and JavaScript. I integrated the OpenWeather API for real-time weather information and forecasts, utilized the Geolocation API for automatic location detection and geocoding, and incorporated the NewsCatcher API to fetch news articles related to the user's country.",
    "link": "https://get-place-info.vercel.app/",
    "githubLink": "https://github.com/aryanbhat/KnowYourPlace",
    "image": "/knowyourplace.webp",
    "technologies": ["HTML", "CSS", "JavaScript", "OpenWeather API"]
  }
]
